DocumentJournals/SalesDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DocumentJournal>
		<Properties>
			<Name>SalesDocuments</Name>
			<RegisteredDocuments>
				<xr:Item>Document.CustomerInvoice</xr:Item>
				<xr:Item>Document.AcceptanceCertificate</xr:Item>
				<xr:Item>Document.CustomerOrder</xr:Item>
				<xr:Item>Document.InvoiceForPayment</xr:Item>
				<xr:Item>Document.CustomerInvoiceNote</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Company</Name>
					<References>
						<xr:Item>Document.CustomerInvoice.Attribute.Company</xr:Item>
						<xr:Item>Document.CustomerInvoiceNote.Attribute.Company</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.Company</xr:Item>
						<xr:Item>Document.AcceptanceCertificate.Attribute.Company</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.Company</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>OperationKind</Name>
					<References>
						<xr:Item>Document.CustomerInvoice.Attribute.OperationKind</xr:Item>
						<xr:Item>Document.CustomerInvoiceNote.Attribute.OperationKind</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.OperationKind</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Counterparty</Name>
					<References>
						<xr:Item>Document.CustomerInvoice.Attribute.Counterparty</xr:Item>
						<xr:Item>Document.CustomerInvoiceNote.Attribute.Counterparty</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.Counterparty</xr:Item>
						<xr:Item>Document.AcceptanceCertificate.Attribute.Counterparty</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.Counterparty</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Contract</Name>
					<References>
						<xr:Item>Document.CustomerInvoice.Attribute.Contract</xr:Item>
						<xr:Item>Document.CustomerInvoiceNote.Attribute.Contract</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.Contract</xr:Item>
						<xr:Item>Document.AcceptanceCertificate.Attribute.Contract</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.Contract</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Division</Name>
					<References>
						<xr:Item>Document.CustomerInvoice.Attribute.Division</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.Division</xr:Item>
						<xr:Item>Document.AcceptanceCertificate.Attribute.Division</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.SalesStructuralUnit</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Amount</Name>
					<References>
						<xr:Item>Document.CustomerInvoice.Attribute.DocumentAmount</xr:Item>
						<xr:Item>Document.CustomerInvoiceNote.Attribute.DocumentAmount</xr:Item>
						<xr:Item>Document.AcceptanceCertificate.Attribute.DocumentAmount</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.DocumentAmount</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.DocumentAmount</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Currency</Name>
					<References>
						<xr:Item>Document.CustomerInvoice.Attribute.DocumentCurrency</xr:Item>
						<xr:Item>Document.CustomerInvoiceNote.Attribute.DocumentCurrency</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.DocumentCurrency</xr:Item>
						<xr:Item>Document.AcceptanceCertificate.Attribute.DocumentCurrency</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.DocumentCurrency</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Comment</Name>
					<References>
						<xr:Item>Document.CustomerInvoice.Attribute.Comment</xr:Item>
						<xr:Item>Document.CustomerInvoiceNote.Attribute.Comment</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.Comment</xr:Item>
						<xr:Item>Document.AcceptanceCertificate.Attribute.Comment</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.Comment</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Author</Name>
					<References>
						<xr:Item>Document.AcceptanceCertificate.Attribute.Author</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.Author</xr:Item>
						<xr:Item>Document.CustomerInvoice.Attribute.Author</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.Author</xr:Item>
						<xr:Item>Document.CustomerInvoiceNote.Attribute.Author</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Responsible</Name>
					<References>
						<xr:Item>Document.AcceptanceCertificate.Attribute.Responsible</xr:Item>
						<xr:Item>Document.CustomerOrder.Attribute.Responsible</xr:Item>
						<xr:Item>Document.CustomerInvoice.Attribute.Responsible</xr:Item>
						<xr:Item>Document.InvoiceForPayment.Attribute.Responsible</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

DocumentJournals/SalesDocuments/Forms/ListForm/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// EVENT HANDLERS   
//

&AtServer
// Procedure - form event handler OnCreateAtServer
// 
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Not CommonUse.OnCreateAtServer(ThisForm, Cancel, StandardProcessing) Then
		Return;
	EndIf;
	
	For Each String IN Metadata.DocumentJournals.SalesDocuments.RegisteredDocuments Do
		Items.DocumentType.ChoiceList.Add(String.Synonym, String.Synonym);
		DocumentTypes.Add(String.Synonym, String.Name);
	EndDo;
	
	// Set the format for the current date: DF=H:mm
	SmallBusinessServer.SetDesignDateColumn(List);
	
EndProcedure

// Procedure - form event handler "OnLoadDataFromSettingsAtServer".
//
&AtServer
Procedure OnLoadDataFromSettingsAtServer(Settings)
	
	Company				 		= Settings.Get("Company");
	DocumentTypePresentation 		= Settings.Get("DocumentTypePresentation");
	Counterparty			 			= Settings.Get("Counterparty");
	Division		 			= Settings.Get("Division");
	Responsible		 			= Settings.Get("Responsible");
	
	SelectedTypeOfDocument = DocumentTypes.FindByValue(DocumentTypePresentation);
	If SelectedTypeOfDocument = Undefined Then
		DocumentType = "";
	Else
		DocumentType = SelectedTypeOfDocument.Presentation;
	EndIf;
	
	SmallBusinessClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
	SmallBusinessClientServer.SetListFilterItem(List, "Type", ?(ValueIsFilled(DocumentType), Type("DocumentRef." + DocumentType), Undefined), ValueIsFilled(DocumentType));
	SmallBusinessClientServer.SetListFilterItem(List, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	SmallBusinessClientServer.SetListFilterItem(List, "Division", Division, ValueIsFilled(Division));
	SmallBusinessClientServer.SetListFilterItem(List, "Responsible", Responsible, ValueIsFilled(Responsible));
	
EndProcedure // OnLoadDataFromSettingsAtServer()

&AtClient
// Procedure - event handler OnChange of attribute DocumentType.
// 
Procedure DocumentTypeOnChange(Item)
	
	SelectedTypeOfDocument = DocumentTypes.FindByValue(DocumentTypePresentation);
	If SelectedTypeOfDocument = Undefined Then
		DocumentType = "";
	Else
		DocumentType = SelectedTypeOfDocument.Presentation;
	EndIf;
	
	SmallBusinessClientServer.SetListFilterItem(List, "Type", ?(ValueIsFilled(DocumentType), Type("DocumentRef." + DocumentType), Undefined), ValueIsFilled(DocumentType));
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of attribute Division.
// 
Procedure DivisionOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(List, "Division", Division, ValueIsFilled(Division));
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of attribute Responsible.
// 
Procedure ResponsibleOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(List, "Responsible", Responsible, ValueIsFilled(Responsible));
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of attribute Counterparty.
// 
Procedure CounterpartyOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(List, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of the Company attribute.
// 
Procedure CompanyOnChange(Item)
	
	SmallBusinessClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
	
EndProcedure

&AtClient
Procedure ListBeforeAddRow(Item, Cancel, Copy, Parent, Group)
	
	If ValueIsFilled(DocumentType) Then
		
		Cancel = True;
		
		ParametersStructure = New Structure();
		ParametersStructure.Insert("Counterparty", Counterparty);
		ParametersStructure.Insert("Division", Division);
		ParametersStructure.Insert("Company", Company);
		
		OpenForm("Document." + DocumentType + ".ObjectForm", New Structure("FillingValues", ParametersStructure));
		
	EndIf; 
	
EndProcedure
